#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.create_S3_bucket.aws_s3_bucket.bucket1: Refreshing state... [id=learning-dev-grahamwright.net]
aws_iam_role.batch_role: Refreshing state... [id=batch_role]
aws_security_group.batch_security_group: Refreshing state... [id=sg-05f28f03e0bcde8aa]
aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=batch_role-20220405015944530800000001]
module.create_S3_bucket.aws_s3_bucket_acl.bucket1: Refreshing state... [id=learning-dev-grahamwright.net,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.lambda_hello_world will be created
  + resource "aws_s3_object" "lambda_hello_world" {
      + acl                    = "private"
      + bucket                 = "learning-dev-grahamwright.net"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "8e6d8a090c1f33b6dabbc6cc6cd1b94a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "hello-world.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../../src/hello-world.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.aws_subnet_ids.all_default_subnets,
  on main.tf line 29, in data "aws_subnet_ids" "all_default_subnets":
  29: data "aws_subnet_ids" "all_default_subnets" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gwright99, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure With TF`*